# Tutorial 8: Statistics and Data Analysis

**The goal of this assignment is to perform a data analysis on the survivor of the [Titanic disaster](https://en.wikipedia.org/wiki/RMS_Titanic).**

At first, you have to answer 10 questions based on some descriptive statistics that I already computed.

Then, you will have to implement some code to answer additional questions on the passengers.

In both case, you will use Pandas: a popular library to perform data analysis in Python.

This library is very convenient, and can replace Excel when combined with Jupyter.

I recommend you to read ["10 minutes to pandas"](https://pandas.pydata.org/pandas-docs/stable/10min.html) to get an overview of Pandas.

__Grade scale__: 20 points
- __correct code/answer__: 1 point
- __incorrect code/answer__: 0 point

__Further documentations__:
* https://www.kaggle.com/c/titanic
* https://learnxinyminutes.com/docs/python/
* https://pandas.pydata.org/pandas-docs/stable/
* https://pandas.pydata.org/pandas-docs/stable/10min.html

# Core

## Dataset Variables

- __survival__        Survival(0 = No; 1 = Yes)
- __pclass__          Passenger Class (1 = 1st; 2 = 2nd; 3 = 3rd)
- __name__            Name
- __sex__             Sex
- __age__             Age
- __sibsp__           Number of Siblings/Spouses Aboard
- __parch__           Number of Parents/Children Aboard
- __ticket__          Ticket Number
- __fare__            Passenger Fare
- __cabin__           Cabin
- __embarked__        Port of Embarkation (C = Cherbourg; Q = Queenstown; S = Southampton)

In [2]:
# we import pandas
# with 'pd' as alias
import pandas as pd

In [3]:
# import the dataset from a csv.gz
# 'df' is a dataframe ~excel sheet
df = pd.read_csv('titanic.csv')

df.head(10)

,pclass,survival,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S
5,1,1,"Anderson, Mr. Harry",male,48.0000,0,0,19952,26.5500,E12,S
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0000,1,0,13502,77.9583,D7,S
7,1,0,"Andrews, Mr. Thomas Jr",male,39.0000,0,0,112050,0.0000,A36,S
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0000,2,0,11769,51.4792,C101,S
9,1,0,"Artagaveytia, Mr. Ramon",male,71.0000,0,0,PC 17609,49.5042,NaN,C

# Questions

In [4]:
# display dataset summary
# great to get an overview
df.describe(include="all")

,pclass,survival,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
count,1309.000000,1309.000000,1309,1309,1046.000000,1309.000000,1309.000000,1309,1308.000000,295,1307
unique,NaN,NaN,1307,2,NaN,NaN,NaN,929,NaN,186,3
top,NaN,NaN,"Connolly, Miss. Kate",male,NaN,NaN,NaN,CA. 2343,NaN,C23 C25 C27,S
freq,NaN,NaN,2,843,NaN,NaN,NaN,11,NaN,6,914
mean,2.294882,0.381971,NaN,NaN,29.881135,0.498854,0.385027,NaN,33.295479,NaN,NaN
std,0.837836,0.486055,NaN,NaN,14.413500,1.041658,0.865560,NaN,51.758668,NaN,NaN
min,1.000000,0.000000,NaN,NaN,0.166700,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,2.000000,0.000000,NaN,NaN,21.000000,0.000000,0.000000,NaN,7.895800,NaN,NaN
50%,3.000000,0.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,3.000000,1.000000,NaN,NaN,39.000000,1.000000,0.000000,NaN,31.275000,NaN,NaN
max,3.000000,1.000000,NaN,NaN,80.000000,8.000000,9.000000,NaN,512.329200,NaN,NaN

__1. How many passengers were on the Titanic ?__

In [5]:
def Q1():
    ### BEGIN SOLUTION
    return len(df.index)
    ### END SOLUTION
    
Q1()

1309

__2. How passengers were male ?__

In [33]:
def Q2():
    ### BEGIN SOLUTION
    return len(df[df['sex'] == 'male'])
    ### END SOLUTION
    
Q2()

843

__3. How many different cabins were on the Titanic ?__

In [47]:
def Q3():
    ### BEGIN SOLUTION
    return max(df['age'])
    ### END SOLUTION
    
Q3()

80.0

__4. How old was the oldest person on board ?__

In [ ]:
def Q4():
    ### BEGIN SOLUTION
    return max(df['age'])
    ### END SOLUTION
    
Q4()

__5. What was the median ticket fare (rounded up) ?__

In [44]:
def Q5():
    ### BEGIN SOLUTION
    return round(df['fare'].median())
    ### END SOLUTION
    
Q5()

14

__6. What was the passenger class with the most people ?__

In [9]:
def Q6():
    ### BEGIN SOLUTION
    new_df = df[['pclass', 'survival']]
    return df.loc[df['pclass'].idxmax(), 'pclass']
    ### END SOLUTION
    
Q6()

3

__7. From which location did people embarked the most (one letter) ?__

In [59]:
def Q7():
    ### BEGIN SOLUTION
    s = df['embarked'].value_counts()
    return s.to_string()[0]
    ### END SOLUTION
    
Q7()

S

__8. How many people survived the Titanic disaster (rounded down) ?__

In [111]:
def Q8():
    ### BEGIN SOLUTION
    return len(df[df['survival'] == 1])
    ### END SOLUTION
    
Q8()

500

__9. What was the maximum number of parents/children somebody had ?__

In [116]:
def Q9():
    ### BEGIN SOLUTION
    return max(df['parch'])
    ### END SOLUTION
    
Q9()

9

__10. What is the 3rd quartile for the number of sibblings/spouses ?__

In [ ]:
def Q10():
    ### BEGIN SOLUTION
    return None
    ### END SOLUTION
    
Q10()

# Queries

__1. Select all values of the name column__
- __hint__: have a look at https://pandas.pydata.org/pandas-docs/stable/indexing.html#basics

In [7]:
def Q1(df):
    ### BEGIN SOLUTION
    return df['name']
    ### END SOLUTION
    
Q1(df).head()

0                      Allen, Miss. Elisabeth Walton
1                     Allison, Master. Hudson Trevor
2                       Allison, Miss. Helen Loraine
3               Allison, Mr. Hudson Joshua Creighton
4    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
Name: name, dtype: object

__2. Select all passengers older than 50 years old (included)__
- __hint__: have a look at https://pandas.pydata.org/pandas-docs/stable/indexing.html#boolean-indexing

In [62]:
def Q2(df):
    ### BEGIN SOLUTION
    return df[df['age'] <= 50]
    ### END SOLUTION
    
Q2(df).head()

,pclass,survival,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S

__3. Select all passengers in 1st and 2nd class__
- __hint__: you can also take the complement statement

In [66]:
def Q3(df):
    ### BEGIN SOLUTION
    return df[(df['pclass'] == 1) | (df['pclass'] == 2)]
    ### END SOLUTION
    
Q3(df).head()

,pclass,survival,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S

__4. Select the passengers who embarked at Queenstown ("Q") and paid more than 50 (included)__
- __hint__: have a look (again) at https://pandas.pydata.org/pandas-docs/stable/indexing.html#boolean-indexing

In [63]:
def Q4(df):
    ### BEGIN SOLUTION
    return df[df['embarked'] == 'Q']
    ### END SOLUTION
    
Q4(df).head()

,pclass,survival,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
206,1,0,"Minahan, Dr. William Edward",male,44.0,2,0,19928,90.00,C78,Q
207,1,1,"Minahan, Miss. Daisy E",female,33.0,1,0,19928,90.00,C78,Q
208,1,1,"Minahan, Mrs. William Edward (Lillian E Thorpe)",female,37.0,1,0,19928,90.00,C78,Q
469,2,1,"Keane, Miss. Nora A",female,NaN,0,0,226593,12.35,E101,Q
470,2,0,"Keane, Mr. Daniel",male,35.0,0,0,233734,12.35,NaN,Q

__5. Select the name of passengers below 18 years old (included) who did not survived__
- __hint__: you can combine the syntax from the previous queries

In [68]:
def Q5(df):
    ### BEGIN SOLUTION
    return df[(df['age'] <= 18) & (df['survival'] == 0)]['name']
    ### END SOLUTION
    
Q5(df).head()

2                    Allison, Miss. Helen Loraine
53                         Carrau, Mr. Jose Pedro
228    Penasco y Castellana, Mr. Victor de Satode
326                    Andrew, Mr. Edgardo Samuel
331                      Bailey, Mr. Percy Andrew
Name: name, dtype: object

__6. Compute the value counts (frequencies) for the passenger class variable__
- __hint__: there is a method on pandas.Series to handle this case

In [70]:
def Q6(df):
    ### BEGIN SOLUTION
    return df['pclass'].value_counts()
    ### END SOLUTION
    
Q6(df)

'3    709\n1    323\n2    277'

__7. Compute the 95% quantile of the age variable__
- __hint__: convert the result to an int with `int()`

In [20]:
def Q7(df):
    ### BEGIN SOLUTION
    return int(df['age'].quantile(0.95))
    ### END SOLUTION
    
Q7(df)

57

__8. Compute the mean survival rate by passenger class__
- __hint__: have a look at http://pandas.pydata.org/pandas-docs/stable/groupby.html

In [19]:
def Q8(df):
    ### BEGIN SOLUTION
    return df[['survival', 'pclass']].groupby('pclass').mean()
    ### END SOLUTION
    
Q8(df)

        survival
pclass
1       0.619195
2       0.429603
3       0.255289

__9. Compute the correlation for every numerical variable pair using the spearman method__
- __hint__: have a look at https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.corr.html

In [21]:
def Q9(df):
    ### BEGIN SOLUTION
    return df[['pclass', 'survival', 'age', 'sibsp', 'parch', 'ticket', 'fare']].corr(method=spearman)
    ### END SOLUTION
    
Q9(df)

NameError: name 'spearman' is not defined

__10. Compute the number of passengers per passenger class (rows) and survival (columns)__
- __hint__: have a look at https://pandas.pydata.org/pandas-docs/stable/generated/pandas.crosstab.html

In [ ]:
def Q10(df):
    ### BEGIN SOLUTION
    return None
    ### END SOLUTION
    
Q10(df)